---
kind: property
id: P:Autodesk.Revit.UI.PushButton.AvailabilityClassName
zh: 按钮
source: html/3636af6d-5d81-19ee-c3e2-2b7ed8126f86.htm
---
# Autodesk.Revit.UI.PushButton.AvailabilityClassName Property

**中文**: 按钮

The full class name for the class providing the entry point to decide availability of this push button.

## Syntax (C#)
```csharp
public string AvailabilityClassName { get; set; }
```

## Remarks
This is the class implementing IExternalCommandAvailability interface.